# YOLOv3 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Quan_Conv_10bit, [32, 3, 1]],
   [-1, 1, Quan_Conv_10bit, [64, 3, 2]],
   [-1, 1, Quan_Bottleneck_10bit, [64]],
   [-1, 1, Quan_Conv_10bit, [128, 3, 2]],
   [-1, 2, Quan_Bottleneck_10bit, [128]],
   [-1, 1, Quan_Conv_10bit, [256, 3, 2]],
   [-1, 8, Quan_Bottleneck_10bit, [256]],
   [-1, 1, Quan_Conv_10bit, [512, 3, 2]],
   [-1, 8, Quan_Bottleneck_10bit, [512]],
   [-1, 1, Quan_Conv_4bit, [1024, 3, 2]],  #44  4bit
   [-1, 4, Quan_Bottleneck_4bit, [1024]],  #45~52  4bit

  ]

# YOLOv3 head
head:
  [[-1, 1, Quan_Bottleneck_4bit_false, [1024]], #53,54 4bit
   [-1, 1, Quan_Conv_6bit, [512, 1, 1]], #55 6bit
   [-1, 1, Quan_Conv_4bit, [1024, 3, 1]], #56 4bit
   [-1, 1, Quan_Conv_6bit, [512, 1, 1]], #57 6bit
   [-1, 1, Quan_Conv_4bit, [1024, 3, 1]],  # 15 (P5/32-large) #58 4bit

   [-2, 1, Quan_Conv_6bit, [256, 1, 1]], #60 6bit
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Quan_Bottleneck_10bit_false, [512]],
   [-1, 1, Quan_Bottleneck_10bit_false, [512]],
   [-1, 1, Quan_Conv_10bit, [256, 1, 1]],
   [-1, 1, Quan_Conv_10bit, [512, 3, 1]],  # 22 (P4/16-medium)

   [-2, 1, Quan_Conv_10bit, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Quan_Bottleneck_10bit_false, [256]],
   [-1, 2, Quan_Bottleneck_10bit_false, [256]],  # 27 (P3/8-small)

   [[27, 22, 15], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
